---@meta

---@class нет (глобальная функция)Lib
нет (глобальная функция) = {}

---Объявляет глобальную переменную и присваивает ей указанное начальное значение. Все глобальные переменные (исключая функции) перед использованием должны быть явно объявлены.
---@param name string имя регистрируемой глобальной переменной
---@param initialValue any type начальное значение глобальной переменной, может быть использовано любое значение любого типа
---@return нет
function нет (глобальная функция).Global(name, initialValue) end
